---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralFramingUtils
source: html/93d93c87-dfa2-12d5-dcb0-13d5cb0c0696.htm
---
# Autodesk.Revit.DB.Structure.StructuralFramingUtils

A collection of Structural Framing Utilities.

## Syntax (C#)
```csharp
public static class StructuralFramingUtils
```